QUIZ LINK: https://github.com/CIT-PROJECTS-2021/cit-cohort-three/blob/main/week12/pandas_quiz.md

SUBMISSION LINK:

# Pandas Quiz

## Question 1

What is the result of the following code?

```python
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), columns=['col1', 'col2', 'col3'])
df.apply(lambda x: x.max() - x.min())
```

A. col1    1.0
    col2    1.0
    col3    1.0
    dtype: float64

B. col1    1.0
    col2    1.0
    col3    1.0
    dtype: float64

C. col1    1.0
    col2    1.0
    col3    1.0
    dtype: float64

D. col1    1.0
    col2    1.0
    col3    1.0
    dtype: float64

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), columns=['col1', 'col2', 'col3'])
df.apply(lambda x: x.max() - x.min())

col1    1.996295
col2    2.893228
col3    1.778063
dtype: float64

## Question 2

Download a csv file from https://stats.govt.nz/assets/Uploads/Business-employment-data/Business-employment-data-June-2022-quarter/Download-data/business-employment-data-june-2022-quarter-csv.zip and load it into a pandas dataframe. How many rows and columns are there?

In [14]:
import pandas as pd

df = pd.read_csv("machine-readable-business-employment-data-june-2022-quarter.csv")
df.info()
df.count()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20254 entries, 0 to 20253
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  20254 non-null  object
 1   Period            20254 non-null  float64
 2   Data_value        15795 non-null  float64
 3   Suppressed        2875 non-null   object
 4   STATUS            20254 non-null  object
 5   UNITS             20254 non-null  object
 6   Magnitude         20254 non-null  int64
 7   Subject           20254 non-null  object
 8   Group             20254 non-null  object
 9   Series_title_1    20254 non-null  object
 10  Series_title_2    20254 non-null  object
 11  Series_title_3    20254 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.2+ MB

Series_reference    20254
Period              20254
Data_value          15795
Suppressed           2875
STATUS              20254
UNITS               20254
Magnitude           20254
Subject             20254
Group               20254
Series_title_1      20254
Series_title_2      20254
Series_title_3      20254
Series_title_4          0
Series_title_5          0
dtype: int64

## Question 3

What method can be used to get the number of non-NA values in a pandas dataframe?

A. `df.count()`

B. `df.na_count()`

C. `df.na_values()`

D. `df.na_count()`

In [19]:
#None of the above

df.isna().sum()

Series_reference        0
Period                  0
Data_value           4459
Suppressed          17379
STATUS                  0
UNITS                   0
Magnitude               0
Subject                 0
Group                   0
Series_title_1          0
Series_title_2          0
Series_title_3          0
Series_title_4      20254
Series_title_5      20254
dtype: int64


## Question 4

Create a dataframe with 10 rows and 3 columns, where the values are random numbers between 1 and 10 (inclusive). Then, replace all values greater than 5 with the value 10.

In [31]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(0,10,size=(10, 3)), columns=['first', 'second', 'third'])
df[df > 5] = 10
df

   first  second  third
0      0      10     10
1     10       2     10
2      3      10     10
3      2       0     10
4     10       1      0
5      5       4     10
6      0       0      0
7     10       5      3
8     10       5      2
9     10       4     10


## Question 5
create a dataframe from this link https://jsonplaceholder.typicode.com/albums